import type { IPost } from '@/entities/Post';

export const POSTS_LIST: IPost[] = [
  {
    id: 1,
    title: 'Заголовок 1',
    imgUrl: '#',
    imgAlt: 'Описание картинки',
    text: 'Текст поста. 26 июня вышел заключительный сезон «Игры в кальмара» — южнокорейского мегахита о социальном неравенстве, который до сих пор остается самым популярным проектом Netflix.'
  },
  {
    id: 2,
    title: 'Заголовок 12',
    imgUrl: '#',
    imgAlt: 'Описание картинки',
    text: 'Текст поста. 26 июня вышел заключительный сезон «Игры в кальмара» — южнокорейского мегахита о социальном неравенстве, который до сих пор остается самым популярным проектом Netflix.'
  },
  {
    id: 3,
    title: 'Заголовок 123',
    imgUrl: '#',
    imgAlt: 'Описание картинки',
    text: 'Текст поста. 26 июня вышел заключительный сезон «Игры в кальмара» — южнокорейского мегахита о социальном неравенстве, который до сих пор остается самым популярным проектом Netflix.'
  },
  {
    id: 4,
    title: 'Заголовок 1234',
    imgUrl: '#',
    imgAlt: 'Описание картинки',
    text: 'Текст поста. 26 июня вышел заключительный сезон «Игры в кальмара» — южнокорейского мегахита о социальном неравенстве, который до сих пор остается самым популярным проектом Netflix.'
  },
  {
    id: 5,
    title: 'Заголовок 12345',
    imgUrl: '#',
    imgAlt: 'Описание картинки',
    text: 'Текст поста. 26 июня вышел заключительный сезон «Игры в кальмара» — южнокорейского мегахита о социальном неравенстве, который до сих пор остается самым популярным проектом Netflix.'
  },
  {
    id: 6,
    title: 'Заголовок 123456',
    imgUrl: '#',
    imgAlt: 'Описание картинки',
    text: 'Текст поста. 26 июня вышел заключительный сезон «Игры в кальмара» — южнокорейского мегахита о социальном неравенстве, который до сих пор остается самым популярным проектом Netflix.'
  },
]
