import type { IPost } from "@/entities/post";

export const POSTS_LIST: IPost[] = [
  {
    id: 1,
    title: 'Заголовок поста',
    imgUrl: '#',
    imgAlt: 'Описание картинки',
    text: 'Текст поста. 26 июня вышел заключительный сезон «Игры в кальмара» — южнокорейского мегахита о социальном неравенстве, который до сих пор остается самым популярным проектом Netflix.'
  },
  {
    id: 2,
    title: 'Заголовок поста',
    imgUrl: '#',
    imgAlt: 'Описание картинки',
    text: 'Текст поста. 26 июня вышел заключительный сезон «Игры в кальмара» — южнокорейского мегахита о социальном неравенстве, который до сих пор остается самым популярным проектом Netflix.'
  },
  {
    id: 3,
    title: 'Заголовок поста',
    imgUrl: '#',
    imgAlt: 'Описание картинки',
    text: 'Текст поста. 26 июня вышел заключительный сезон «Игры в кальмара» — южнокорейского мегахита о социальном неравенстве, который до сих пор остается самым популярным проектом Netflix.'
  },
  {
    id: 4,
    title: 'Заголовок поста',
    imgUrl: '#',
    imgAlt: 'Описание картинки',
    text: 'Текст поста. 26 июня вышел заключительный сезон «Игры в кальмара» — южнокорейского мегахита о социальном неравенстве, который до сих пор остается самым популярным проектом Netflix.'
  },
  {
    id: 5,
    title: 'Заголовок поста',
    imgUrl: '#',
    imgAlt: 'Описание картинки',
    text: 'Текст поста. 26 июня вышел заключительный сезон «Игры в кальмара» — южнокорейского мегахита о социальном неравенстве, который до сих пор остается самым популярным проектом Netflix.'
  },
  {
    id: 6,
    title: 'Заголовок поста',
    imgUrl: '#',
    imgAlt: 'Описание картинки',
    text: 'Текст поста. 26 июня вышел заключительный сезон «Игры в кальмара» — южнокорейского мегахита о социальном неравенстве, который до сих пор остается самым популярным проектом Netflix.'
  },
]
